<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">

<!--Converted with LaTeX2HTML 2002-2 (1.70)
original version by:  Nikos Drakos, CBLU, University of Leeds
* revised and updated by:  Marcus Hennecke, Ross Moore, Herb Swan
* with significant contributions from:
  Jens Lippmann, Marek Rouchal, Martin Wilck and others -->
<HTML>
<HEAD>
<TITLE>Introducción</TITLE>
<META NAME="description" CONTENT="Introducción">
<META NAME="resource-type" CONTENT="document">
<META NAME="distribution" CONTENT="global">

<META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
<META NAME="Generator" CONTENT="LaTeX2HTML v2002-2">
<META HTTP-EQUIV="Content-Style-Type" CONTENT="text/css">

<LINK REL="STYLESHEET" HREF="memoria.css">

<LINK REL="next" HREF="node13.html">
<LINK REL="previous" HREF="node2.html">
<LINK REL="up" HREF="memoria.html">
<LINK REL="next" HREF="node4.html">
</HEAD>

<BODY >
<!--Navigation Panel-->
<A NAME="tex2html201"
  HREF="node4.html">
<IMG WIDTH="37" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="next" SRC="next.png"></A> 
<A NAME="tex2html197"
  HREF="memoria.html">
<IMG WIDTH="26" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="up" SRC="up.png"></A> 
<A NAME="tex2html191"
  HREF="node2.html">
<IMG WIDTH="63" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="previous" SRC="prev.png"></A> 
<A NAME="tex2html199"
  HREF="node1.html">
<IMG WIDTH="65" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="contents" SRC="contents.png"></A>  
<BR>
<B> Siguiente:</B> <A NAME="tex2html202"
  HREF="node4.html">Conceptos y definiciones</A>
<B> Subir:</B> <A NAME="tex2html198"
  HREF="memoria.html">memoria</A>
<B> Anterior:</B> <A NAME="tex2html192"
  HREF="node2.html">&#205;ndice de Figuras</A>
 &nbsp; <B>  <A NAME="tex2html200"
  HREF="node1.html">&#205;ndice General</A></B> 
<BR>
<BR>
<!--End of Navigation Panel-->

<H1><A NAME="SECTION00300000000000000000"></A><A NAME="sec:introduccion"></A>
<BR>
Introducci&#243;n
</H1>

<P>
Las telecomunicaciones forman hoy d&#237;a parte fundamental de la sociedad.
La inform&#225;tica se ha ido arraigando en nuestros quehaceres cotidianos,
hasta l&#237;mites insospechados hace tan s&#243;lo diez a&#241;os. En este contexto, es
f&#225;cil imaginar la importancia de disponer de servicios inform&#225;ticos y de
telecomunicaciones adaptados a las necesidades personales y laborales de
cada uno. En particular, y m&#225;s a&#250;n en el caso que nos ocupa, se hace patente
la necesidad de ofrecer servicios totalmente ubicuos en la medida de lo
posible, esto es, usables sin importar nuestra localizaci&#243;n ni otros
detalles triviales.

<P>
Las corrientes inform&#225;ticas actuales tienden a descentralizar los recursos
en pos de un gran sistema, distribu&#237;do y omnipresente, que sea utilizable
de cuantas formas pueda concebir el usuario. Esto derriba los conceptos
cl&#225;sicos de sistema inform&#225;tico y les infiere una nueva dimensi&#243;n, vali&#233;ndose
de los avances diarios en el campo de las redes y las telecomunicaciones.
M&#225;s concretamente, Internet, la Red de redes, ha permitido desde hace unos
a&#241;os en adelante constituir un gigantesco sistema de servicios distribu&#237;dos
a lo largo y ancho del planeta.

<P>
De forma a&#250;n m&#225;s reciente, la explosi&#243;n del mercado de las comunicaciones
m&#243;viles y las distintas tecnolog&#237;as que surgen entorno al mismo han hecho
factible la posibilidad de comunicar dos puntos cualesquiera del globo
casi inmediatamente. Sat&#233;lites, radiofrecuencias... M&#250;ltiples formas de
interconexi&#243;n, cada una con dispositivos y escenarios de uso diferentes,
permiten la utilizaci&#243;n de sistemas inform&#225;ticos en casi cualquier situaci&#243;n
imaginable.

<P>
Gracias al abaratamiento de las conexiones a Internet y la magnitud de la
interconexi&#243;n conseguida, han surgido nuevos conceptos como el de
<I>teletrabajo</I>. Se empieza a alcanzar el objetivo de la deslocalizaci&#243;n
de recursos. Cada vez importa menos donde est&#233;s a la hora de utilizar el sistema.
El usuario ya no tiene que lidiar con copias de los recursos para su propio
uso, ni con un sistema monol&#237;tico que s&#243;lo pueda utilizar &#233;l. Ahora los usuarios
no ven m&#225;s que una interfaz del sistema, un terminal, un sencillo PC conectado
a la red, que les permite trabajar utilizando los recursos de forma transparente.

<P>
Por supuesto, esta es la visi&#243;n ideal del escenario particular que buscamos.
En la pr&#225;ctica, resulta mucho m&#225;s complejo de llevar a cabo por factores
externos al propio avance tecnol&#243;gico. La introducci&#243;n de una red global de
interconexi&#243;n de ordenadores y otros dispositivos ha permitido derribar los
obst&#225;culos de la localizaci&#243;n f&#237;sica, pero tambi&#233;n ha introducido problemas
nuevos en cuanto al acceso a la informaci&#243;n se refiere. En esta sociedad la
informaci&#243;n es un bien muy preciado que mueve cantidades ingentes de dinero.
Un bien cuya utilizaci&#243;n est&#225; controlada fundamentalmente por motivaciones
comerciales. Teniendo esto en cuenta, hay que proveer mecanismos de control
de acceso a los recursos, la informaci&#243;n, los servicios, que permitan
identificar a los usuarios y mantener alejados a aquellos no autorizados.

<P>
La seguridad inform&#225;tica es el freno natural del avance exponencial del
campo. De hecho, es precisamente la seguridad la responsable de que el objetivo
que tratamos al inicio de este texto no se haya cumplido a&#250;n. Es necesario
mantener un control absoluto sobre los recursos y sus usuarios a fin de evitar
usos malintencionados o que puedan perjudicarnos de manera alguna. Y el primer
paso para ejercer este control suele ser la localizaci&#243;n de los usuarios y,
por tanto, la imposibilidad de acceder al sistema desde donde deseemos.

<P>
Este es precisamente el problema que trataremos abordar y solventar en el
presente proyecto. En el entorno de la Universidad Rey Juan Carlos, las
necesidades de seguridad son muy altas, pero no deben cumplirse a costa
de recortes en los servicios prestados. Por ello es necesario dar al personal
de esta instituci&#243;n la posibilidad de trabajar desde cualquier ubicaci&#243;n requerida
por las circunstancias. Continuaremos pues el trabajo
<A NAME="tex2html1"
  HREF="footnode.html#foot361"><SUP>1.1</SUP></A> de
Te&#243;filo Romera en el &#193;rea de Comunicaciones de la Universidad para proporcionar
un servicio de acceso remoto totalmente seguro mediante terminales <I>GSM</I>
y <I>GPRS</I> a la red corporativa y sus servicios asociados.

<P>
En los siguientes cap&#237;tulos se describir&#225; en detalle el servicio prestado
por <I>TME</I><A NAME="tex2html2"
  HREF="footnode.html#foot362"><SUP>1.2</SUP></A>, as&#237; como la
definici&#243;n, dise&#241;o e implementaci&#243;n de las infraestructuras necesarias por parte
de la Universidad Rey Juan Carlos para la puesta en producci&#243;n de dicho servicio.

<P>
Durante este cap&#237;tulo introductorio trataremos dejar claros los conceptos
b&#225;sicos que se utilizar&#225;n a lo largo de esta memoria para explicar el proyecto.
Formalizaremos definiciones de los protocolos y tecnolog&#237;as utilizados,
centr&#225;ndonos en los puntos m&#225;s destacados y relevantes que se han tenido
en cuenta al dise&#241;ar el servicio.

<P>
A continuaci&#243;n, en un segundo cap&#237;tulo, describiremos los objetivos iniciales
y los cambios que han sufrido a lo largo de la ejecuci&#243;n del proyecto, as&#237; como
todas las actividades que han implicado desde el inicio hasta la puesta en marcha
del servicio.

<P>
En el cap&#237;tulo tercero abordaremos la implementaci&#243;n realizada del servicio
con todos los detalles necesarios, relativos a la configuraci&#243;n del equipo
terminador de t&#250;neles, tanto a nivel de sistema operativo como de los servicios
externos.

<P>
Por &#250;ltimo, en el cuarto cap&#237;tulo, analizaremos las conclusiones derivadas del
desarrollo del proyecto y los posibles trabajos a realizar en un futuro partiendo
de la base aqu&#237; obtenida.

<P>
<BR><HR>
<!--Table of Child-Links-->
<A NAME="CHILD_LINKS"><STRONG>Subsecciones</STRONG></A>

<UL>
<LI><A NAME="tex2html203"
  HREF="node4.html">Conceptos y definiciones</A>
<UL>
<LI><A NAME="tex2html204"
  HREF="node5.html">Redes privadas virtuales</A>
<LI><A NAME="tex2html205"
  HREF="node6.html">Confidencialidad e integridad</A>
<UL>
<LI><A NAME="tex2html206"
  HREF="node7.html">IPSec</A>
<LI><A NAME="tex2html207"
  HREF="node8.html">El protocolo AH</A>
<UL>
<LI><A NAME="tex2html208"
  HREF="node9.html">memoria</A>
</UL>
</UL>
<LI><A NAME="tex2html209"
  HREF="node10.html">Autenticación y Autorización</A>
<UL>
<LI><A NAME="tex2html210"
  HREF="node11.html">El protocolo IKE</A>
<LI><A NAME="tex2html211"
  HREF="node12.html">Radius</A>
</UL></UL></UL>
<!--End of Table of Child-Links-->
<HR>
<!--Navigation Panel-->
<A NAME="tex2html201"
  HREF="node4.html">
<IMG WIDTH="37" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="next" SRC="next.png"></A> 
<A NAME="tex2html197"
  HREF="memoria.html">
<IMG WIDTH="26" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="up" SRC="up.png"></A> 
<A NAME="tex2html191"
  HREF="node2.html">
<IMG WIDTH="63" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="previous" SRC="prev.png"></A> 
<A NAME="tex2html199"
  HREF="node1.html">
<IMG WIDTH="65" HEIGHT="24" ALIGN="BOTTOM" BORDER="0" ALT="contents" SRC="contents.png"></A>  
<BR>
<B> Siguiente:</B> <A NAME="tex2html202"
  HREF="node4.html">Conceptos y definiciones</A>
<B> Subir:</B> <A NAME="tex2html198"
  HREF="memoria.html">memoria</A>
<B> Anterior:</B> <A NAME="tex2html192"
  HREF="node2.html">&#205;ndice de Figuras</A>
 &nbsp; <B>  <A NAME="tex2html200"
  HREF="node1.html">&#205;ndice General</A></B> 
<!--End of Navigation Panel-->
<ADDRESS>
Jaime Perez Crespo
2005-02-09
</ADDRESS>
</BODY>
</HTML>
