<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">

<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en" lang="es-ES">

<head>
 <meta http-equiv="content-type" content="application/xhtml+xml; charset=iso-8859-15"/>
 <meta name="author" content="jaime perez crespo"/>
 <meta name="keywords" content="jaime perez crespo japecre jperez"/>
 <meta name="description" content="P&acute;gina personal"/>
 <link rel="stylesheet" type="text/css" href="../css/std.css" media="screen"/>
 <link rel="shortcut icon" href="../img/favicon.png"/>
 <script type="text/javascript" src="../js/nicetitle.js"></script>
 <script type="text/javascript" src="../js/styleswitcher.js"></script>
 <title>Jaime P&eacute;rez, p&aacute;gina personal</title>
</head>


<body id="soft">
 <div id="header">
  <h1><a href="../index.html" title="Home">Jaime P&eacute;rez</a></h1>
  <div id="navigation">
   <h3 class="hidden">Navigation</h3>
   <ul>
    <li class="nav1">
     <a href="../index.html" title="Home">Home</a>
    </li>
    <li class="nav2">
     <a href="../docs/index.html" title="Documents">Docs</a>
    </li>
    <li class="nav3">
     <a href="index.html" title="Software">Software</a>
    </li>
    <li class="nav4">
     <a href="../info/index.html" title="About">About</a>
    </li>
   </ul>
  </div>
  <div id="fontcontrol">
   <a href="http://www.flickr.com/photos/jaimeperez/" title="Flickr">flickr</a> | <a href="http://jaimepc.500px.com/" title="500px">500px</a>
  </div>
 </div>
 <div id="wrapper">
  <div id="container">
   <div id="content">
    <div class="contentdiv">
     <div class="divweblog">
      <div class="contentbody">
       <h3>12/02/06: <a href ="adrh_05-06.tbz2"
        title="SiFi">SiFi</a></h3>
       <p>
        SiFi es un sistema de intercambio de ficheros ideado para entornos corporativos.
        Permite realizar b&uacute;squedas, descargas, o incluso subir ficheros a otros
        clientes del sistema, todo en un entorno absolutamente distribu&iacute;do.
        Adicionalmente, permite la posibilidad de buscar y descargar ficheros desde
        fuera del sistema mediante el correo electr&oacute;nico, o enviar ficheros por
        correo desde los propios clientes.</p>
       <p>El sistema se compone de varios m&oacute;dulos que pueden localizarse en
        cualquier m&aacute;quina de la red, gracias a las tecnolog&iacute;as Java
	<a href="http://es.wikipedia.org/wiki/RMI">RMI</a> y
        <a href="http://es.wikipedia.org/wiki/CORBA">CORBA</a> de
        <a href="http://openorb.sourceforge.net/">OpenORB</a>. Es por ello que adem&aacute;s
        los elementos del sistema son multiplataforma y pueden utilizarse mediante
        sencillas e intuitivas interfaces gr&aacute;ficas o web.</p>
       <p>SiFi es la pr&aacute;ctica de la asignatura
        <a href="http://edukalibre.org/moodle/course/view.php?id=8">Arquitecturas
        Distribu&iacute;das de Redes Heterog&eacute;neas</a> de quinto curso de
        Ingenier&iacute;a Inform&aacute;tica, realizada junto con
        <a href="http://www.signal11.org/">&Aacute;lvaro Navarro</a>.</p>
       <div class="itemdetails">
        <span class="item1"><a href="memadrh.pdf"
         title="Memoria en formato PDF">memoria</a></span>&nbsp;
        <span class="item1"><a href="adrh_05-06.tbz2"
         title="Documento comprimido en formato BZIP2">tbz2</a></span>&nbsp;
       </div>
      </div>
      <div class="contentbody">
       <h3>8/10/05: <a href ="jreversi.tbz2"
        title="jReversi">jReversi</a></h3>
       <p>jReversi es una implementaci&oacute;n del cl&aacute;sico juego del <em>Otelo</em>,
        tambi&eacute;n conocido como <em>Reversi</em>. En este caso concreto, se incluyen
        dos implementaciones distintas en el lenguaje <em>Java</em>, una versi&oacute;n con
        alto consumo de memoria y optimizaci&oacute;n de los c&aacute;lculos, y otra que
        mantiene un consumo de memoria constante a costa de una p&eacute;rdida manifiesta de
        rendimiento.</p>
       <p>Las instrucciones para compilar y ejecutar ambas versiones se encuentran en los
        archivos <em>README.txt</em> inclu&iacute;dos. Por supuesto, ser&aacute; necesario
        al menos tener instalado el <em>Java Runtime Environment</em> para probar el juego.</p>
       <p>Este desarrollo forma parte de las pr&aacute;cticas de la asignatura de
        <a href="http://platon.escet.urjc.es/grupo/docencia/ia4/">Inteligencia artificial</a>
        de cuarto curso de Ingenier&iacute;a Inform&aacute;tica, realizadas junto con
        <a href="mailto:taguado en gsyc.escet.urjc.es">Tom&aacute;s Aguado</a> y
        <a href="mailto:ajara en gsyc.escet.urjc.es">&Aacute;ngel Jara</a>.</p>
       <div class="itemdetails">
        <span class="item1"><a href="memia.pdf"
         title="Memoria en formato PDF">memoria</a></span>&nbsp;
        <span class="item1"><a href="jreversi.tbz2"
         title="Documento comprimido en formato BZIP2">tbz2</a></span>&nbsp;
       </div>
      </div>
      <div class="contentbody">
       <h3>17/07/05: <a href ="bolsa.tbz2"
        title="Juego de la bolsa">Juego de la bolsa</a></h3>
       <p>Una colecci&oacute;n de programas que permiten jugar a la bolsa de forma
        distribu&iacute;da, utilizando multicast para ello. Cada m&oacute;dulo realiza
        unas funciones espec&iacute;ficas dentro del juego, desde medir el tiempo de las
        rondas hasta realizar o aceptar ofertas. Cada uno incorpora su propio interfaz
        web a trav&eacute;s del cual se puede consultar u operar el m&oacute;dulo correspondiente.</p>
       <p>Todo ello forma parte de una pr&aacute;ctica de programaci&oacute;n para la
        asignatura de <a href="http://gsyc.escet.urjc.es/docencia/asignaturas/redes-II">
        redes-II</a>, programado en Ada95 y haciendo uso de la librer&iacute;a de
        comunicaciones Lower Layer. &Eacute;sta adolece de un bug que imposibilita
        compilar en sistemas modernos. Para solventarlo es necesario sustituir la
        versi&oacute;n de <i>c_sockets.ads</i> por la proporcionada.</p>
       <div class="itemdetails">
        <span class="item1"><a href="http://gsyc.info/docencia/asignaturas/redes-II/lowerLayer/c_sockets.ads"
         title="Parche para lower layer">c_sockets.ads</a></span>&nbsp;
        <span class="item1"><a href="http://gsyc.info/docencia/asignaturas/redes-II/lowerLayer/ll.tgz"
         title="Librer&iacute;a de comunicaciones">lower layer</a></span>&nbsp;
        <span class="item1"><a href="bolsa.tbz2"
         title="Documento comprimido en formato BZIP2">tbz2</a></span>&nbsp;
       </div>
      </div>
      <div class="contentbody">
       <h3>19/07/04: <a href ="ralserver.tbz2"
        title="Servidor web/proxy">Servidor web/proxy</a></h3>
       <p>Se trata de la pr&aacute;ctica de la asignatura de de
        <a href="http://gsyc.escet.urjc.es/docencia/asignaturas/ral">Redes de
        &aacute;rea local 2002/03</a>. M&aacute;s de 6.000 l&iacute;neas de
        c&oacute;digo en el lenguaje de programaci&oacute;n C, utilizando las
        librer&iacute;as y llamadas al sistema de Linux. El servidor implementa
        m&eacute;todos GET, HEAD y POST tanto para protocolos HTTP/1.0 como
        HTTP/1.1, siguiendo al pie de la letra los RFC que definen ambos
        est&aacute;ndares. Algunas de las caracter&iacute;sticas m&aacute;s
        significativas del servidor son:</p>
       <ul>
        <li><i>Errores personalizados</i>: el servidor permite utilizar
         p&aacute;ginas HTML predefinidas para enviarlas con los mensajes de
         error correspondientes.</li>
        <li><i>Sencilla configuraci&oacute;n</i>: mediante el fichero de
         configuraci&oacute;n del servidor, con una sintaxis similar a la de un
         script de shell en el que se definen variables, es posible personalizar
         ciertos par&aacute;metros concretos del mismo.</li>
        <li><i>Soporte completo de CGI's</i>: soporta el est&aacute;ndar actual
         de CGI de forma que es posible programar nuevos y sencillos CGI's que
         extiendan la funcionalidad del servidor. El acceso a los CGI's est&aacute;
         protegido desde el punto de vista del servidor, y las respuestas de
         &eacute;stos son comprobadas por si incluyen cabeceras que se deban 
         incluir en la respuesta.</li>
        <li><i>Soporte MIME</i>: el servidor incluye un soporte b&aacute;sico
         del est&aacute;ndar MIME en sus respuestas predefinidas.</li>
        <li><i>Degradaci&oacute;nde privilegios</i>: el servidor puede ser utilizado
         con un usuario no privilegiado del sistema, al que cambiar&aacute; nada
         m&aacute;s arrancar, y que puede ser definido tanto desde la l&iacute;nea
         de comandos como en el fichero de configuraci&oacute;n.</li>
        <li><i>Servicio de proxy</i>: el servidor permite un comportamiento de
         proxy an&oacute;nimo.</li>
        <li><i>Web hosting</i>: es posible alojar varias p&aacute;ginas de forma
         simult&aacute;nea en el servidor, siendo &eacute;stas referenciadas
         mediante distintos nombres de dominio.</li>
        <li><i>Estad&iacute;sticas de uso</i>: implementa un m&oacute;dulo de
         estad&iacute;sticas accesible desde la URL <i>/stats</i> en el que se
         informan de todas las peticiones locales v&aacute;lidas, remotas e
         inv&aacute;lidas que se han recibido en el servidor.</li>
        <li><i>Registro de actividad</i>: el servidor guarda un fichero de log
         con todas las peticiones que recibe, e informaci&oacute;n relativa a
         la respuesta que han generado.</li>
        <li><i>Seguridad activa</i>: el servidor ha sido programado teniendo en
         cuenta la seguridad en todo momento. As&iacute;, todas las peticiones
         son comprobadas de forma exhaustiva por si alguna de ellas es malintencionada,
         y se controlan las conexiones que se pueden realizar con el servidor, de
         forma que un atacante no pueda bloquearlo generando m&uacute;ltiples
         conexiones, o hacer que se sature. La multitarea del servidor se basa
         en hilos y mecanismos de concurrencia para evitar un manejo inadecuado
         del mismo.</li>
       </ul>
       <br/>
       <div class="itemdetails">
        <span class="item1"><a href="ralserver.tbz2"
         title="Programa empaquetado en formato BZIP2">tbz2</a></span>&nbsp;
       </div>
      </div>
      <div class="contentbody">
       <h3>26/06/04: <a href ="infodoc.tbz2"
        title="Biblioteca Leonardo Da Vinci">Biblioteca Leonardo Da Vinci</a></h3>
       <p>Se trata de la pr&aacute;ctica de la asignatura de libre elecci&oacute;n
        <a href="http://infodoc.escet.urjc.es/">inform&aacute;tica documental</a>.
        Es una aplicaci&oacute;n web que permite a una biblioteca realizar todas
        sus operaciones en l&iacute;nea, como el alta de nuevos socios o la consulta
        de la base de datos. La aplicaci&oacute;n est&aacute; escrita en ASP con
        VBScript, y utiliza una base de datos Access para almacenar sus contenidos.</p>
       <div class="itemdetails">
        <span class="item2"><a href="meminfodoc.pdf"
         title="Memoria en formato PDF">memoria</a></span>&nbsp;
        <span class="item2"><a href="maninfodoc.pdf"
         title="Manual en formato PDF">manual</a></span>&nbsp;
        <span class="item1"><a href="infodoc.tbz2"
         title="Programa empaquetado en formato BZIP2">tbz2</a></span>&nbsp;
       </div>
      </div>
      <div class="contentbody">
       <h3>26/06/04: <a href="/soft/robotica/" title="Pr&aacute;cticas de rob&oacute;tica">Pr&aacute;cticas de rob&oacute;tica</a></h3>
       <p>Estas son las pr&aacute;cticas correspondientes a la asignatura
        optativa de <a href="http://gsyc.escet.urjc.es/docencia/asignaturas/robotica/">
        rob&oacute;tica</a>. Se trata de tres pr&aacute;cticas de car&aacute;cter
        obligatorio, todas ellas realizadas con un robot <i>Lego Mindstorms</i> y
        programadas en el lenguaje C para el sistema operativo <i>BrickOS</i>:</p>
       <ul>
        <li>Seguir una l&iacute;nea: una peque&ntilde;a pr&aacute;ctica introductoria
         que sirve para familiarizarse con el entorno de desarrollo. El objetivo de la
         pr&aacute;ctica es que el robot sea capaz de seguir una l&iacute;nea negra
         pintada sobre un suelo blanco, sin perderla.</li>
        <li>El juego del pa&ntilde;uelo: en esta pr&aacute;ctica se pretende que dos
         robots se enfrenten en el conocido juego del pa&ntilde;uelo. Ambos se
         situar&aacute;n frente a frente, sobre una l&iacute;nea negra pintada sobre
         suelo blanco, con una lata de refresco lastrada en el medio de ambos. Los
         robots deben seguir la l&iacute;nea hasta llegar a la lata, cogerla, y 
         llev&aacute;rsela a su extremo de la l&iacute;nea.</li>
        <li>Robot limpialatas: la pr&aacute;ctica m&aacute;s elaborada consiste en un
         robot que debe recorrer un peque&ntilde;o laberinto buscando latas en &eacute;l,
         y operando con ellas en funci&oacute;n del color de las mismas. Las latas
         negras han de apartarse, mientras que las latas blancas deber&aacute;n
         llevarse a una zona delimitada como almac&aacute;n. As&iacute; mismo, la 
         posici&oacute;n de una de las latas es conocida de antemano, mientras que la
         otra lata que habr&aacute; en el laberinto se encuentra en una posici&oacute;n
         desconocida.</li>
       </ul>
       <br/>
       <div class="itemdetails">
        <span class="item1"><a href="robotica/prac1.c"
         title="Seguir una l&iacute;nea">l&iacute;nea</a></span>&nbsp;
        <span class="item1"><a href="robotica/prac2.c"
         title="Juego del pa&ntilde;uelo">pa&ntilde;uelo</a></span>&nbsp;
        <span class="item1"><a href="robotica/prac3.c"
         title="Laberinto de latas">limpialatas</a></span>&nbsp;
       </div>
      </div>
      <div class="contentbody">
       <h3>1/03/04: <a href="/soft/micros/" title="Pr&aacute;cticas de microprocesadores">Pr&aacute;cticas de microprocesadores</a></h3>
       <p>Estas son las pr&aacute;cticas correspondientes a la asignatura optativa de
        <a href="http://dac.escet.urjc.es/docencia/Micros/" target="_blank">microprocesadores</a>.
        Concretamente son 4 pr&aacute;cticas realizadas con un microprocesador Intel 8051 y con
        un PIC, cuyo c&oacute;digo fuente en ensamblador se incluye a continuaci&oacute;n:</p>
       <ul>
        <li><a href="micros/practica1.pdf">Dado electr&oacute;nico:</a>
         una sencilla pr&aacute;ctica introductoria a la programaci&oacute;n en ensamblador
         con microcontroladores. Consiste en dise&ntilde;ar e implementar un peque&ntilde;o
         circuito que se valga de un microcontrolador PIC para simular un dado electr&oacute;nico
         pseudo-aleatorio.</li>
        <li><a href="micros/practica2.pdf">Reloj/cron&oacute;metro digital:</a>
         este desarrollo sobre el procesador Intel 8051 consiste en un reloj y cron&oacute;metro
         digital. El modo de operaci&oacute;n se define al arrancar el programa, momento en el
         que el usuario decide cu&aacute;l de los dos utilizar. Si se selecciona modo reloj, el
         programa pedir&aacute; la hora actual y mostrar&aacute; en el puerto serie la hora,
         increment&aacute;ndola cada segundo. Si se selecciona modo cron&oacute;metro,
         se mostrar&aacute; por el puerto serie la cuenta del mismo incluyendo las
         cent&eacute;simas de segundo, hasta el momento en que se accione el pulsador externo.
         Una nueva pulsaci&oacute;n provocar&aacute; que el cron&oacute;metro se detenga en el
         instante en el que se ha pulsado, mostrando dicho tiempo por el serie. La tercera
         pulsaci&oacute;n resetear&aacute; la rutina de crono.</li>
        <li><a href="micros/practica3.pdf">Reloj/cron&oacute;metro digital:</a>
         misma aplicaci&oacute;n que la anterior pr&aacute;ctica, salvo la inclusi&oacute;n de
         un display de 8 segmentos en el que se muestran los mismos mensajes que por el puerto
         serie.</li>
        <li><a href="micros/practica4.pdf">Invernadero:</a>
         un completo sistema de control de un invernadero, que incluye la posibilidad de consultar
         la temperatura, hora y estado de las luces y calefacci&oacute;n. Tanto las luces como
         la calefacci&oacute;n se encienden y apagan de forma autom&aacute;tica a partir de unas horas
         y temperaturas m&aacute;ximas y m&iacute;nimas indicadas por el usuario. El montaje incluye
         leds para comprobar el estado de luces y calefacci&oacute;n, as&iacute; como un sensor de
         temperatura.</li>
       </ul>
       <br/>
       <div class="itemdetails">
        <span class="item1"><a href="micros/dado.asm"
         title="Dado electr&oacute;nico">dado</a></span>&nbsp;
        <span class="item1"><a href="micros/reloj.a51"
         title="Reloj/cron&oacute;metro digital">reloj</a></span>&nbsp;
        <span class="item1"><a href="micros/prac3.a51"
         title="Reloj/cron&oacute;metro digital con display">reloj display</a></span>&nbsp;
        <span class="item1"><a href="micros/invern.a51"
         title="Invernadero">invernadero</a></span>&nbsp;
       </div>
      </div>
      <div class="contentbody">
       <h3>22/01/04: <a href ="cltps.c"
        title="Esc&aacute;ner de puertos">Esc&aacute;ner de puertos</a></h3>
       <p><i>cltps</i> es un sencillo esc&aacute;ner de puertos para l&iacute;nea de comandos.
        Permite comprobar si hay puertos TCP en estado de escucha y aceptando conexiones desde
        la localizaci&oacute;n actual. Tanto la direcci&oacute;n IP a analizar como el rango
        de puertos a comprobar son perfectamente definibles como par&aacute;metros con los
        que invocar el comando. La gran ventaja es que este sencillo programa permite realizar
        escaneos de puertos de forma sencilla e iterativa, empotrando el comando dentro de
        scripts de shell m&aacute;s complejos. De este modo, es trivial realizar un script que,
        por ejemplo, compruebe que todas las m&aacute;quinas con ciertas direcciones IP
        est&eacute;n funcionando y ejecutando un servicio concreto. La sintaxis del comando
        es muy sencilla:</p>
       <div class="code">
        <pre>cltps <i>direcci&oacute;n_IP</i> <i>puerto_comienzo</i><i>puerto_fin</i></pre>
       </div>
       <p>Donde <i>direcci&oacute;n_IP</i> es la direcci&oacute;n IP de la m&aacute;quina a
        escanear, <i>puerto_comienzo</i> es el primero puerto que analizar, y <i>puerto_fin</i> es el 
        &uacute;ltimo. Por supuesto, es perfectamente posible que <i>puerto_comienzo</i> y
        <i>puerto_fin</i> sean iguales.</p>
       <p>El <a href="cltps.c">c&oacute;digo fuente</a>
        del programa est&aacute; disponible para su descarga. Para compilarlo, necesitar&aacute;s
        los archivos <i>unp.h</i> y <i>lib/error.c</i> del <i>UNIX Network Programming, volumen 1</i>
        y <i>UNIX Network Programming, volumen 2</i> respectivamente, de Richard Stevens.</p>
       <div class="itemdetails">
        <span class="item1"><a href="cltps.c"
         title="C&oacute;digo fuente en C">cltps.c</a></span>&nbsp;
       </div>
      </div>
     </div>
    </div>
   </div>
  </div>
  <div id="sidebar">
   <div class="sidebardiv">
    <!--Categories-->
    <div class="sidebarbody">
     <h3>Links</h3>
     <div class="sidebarin">
      <ul>
       <li><a href="http://www.sourceforge.net" title="Source Forge">Source Forge</a></li>
       <li><a href="http://forja.rediris.es" title="Forja RedIRIS">Forja RedIRIS</a></li>
       <li><a href="http://www.freshmeat.net" title="Freshmeat">Freshmeat</a></li>
       <li><a href="http://www.netbeans.org" title="Netbeans">Netbeans</a></li>
       <li><a href="http://papi.rediris.es/" title="The PAPI AA Framework">PAPI</a></li>
       <li><a href="http://www.edugain.org/" title="eduGAIN">eduGAIN</a></li>
       <li><a href="http://www.simplesamlphp.org/" title="simpleSAMLphp">simpleSAMLphp</a></li>
      </ul>
      </div>
    </div>
   </div>
  </div>
 <div class="clearing">&nbsp;</div>
 </div>
 <div id="footer">
  <div id="credits">
   Copyleft 2015 <a href="/" title="Jaime">Jaime P&eacute;rez</a> |
   Original design by <a href="http://www.globulo.org">Globule</a>
   <br/>
   <a href="http://validator.w3.org/check?uri=referer">XHTML 1.0 Strict</a> |
   <a href="http://jigsaw.w3.org/css-validator/">CSS</a>
  </div>
 </div>
</body>
</html>
